RTP/src/Catalogs/РабочиеГруппы/РабочиеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеГруппы</name>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Тестировщики</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленныйТестировщик</name>
    <type>
      <types>CatalogRef.УдаленныеТестировщики</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАктивныхЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыВРаботе</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RTP/src/Catalogs/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказы</name>
  <attributes>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.ПредоставлениеУслугУдаленногоТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппа</name>
    <type>
      <types>CatalogRef.РабочиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Catalogs/РабочиеГруппы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	КомандаОбновитьСписокНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьСписокНаСервере()
	ТекущийДокументОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийДокументОбъект.ЗаказыВРаботе.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "Выбрать 
	|заказы.Код,
	|заказы.Название
	|ИЗ Справочник.Заказы КАК заказы
	|ГДЕ заказы.Выполнен = ЛОЖЬ И заказы.РабочаяГруппа = &ТекущийДокументСсылка И заказы.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТекущийДокументСсылка", ТекущийДокументОбъект.Ссылка);
	Результат = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = Результат.Выбрать();    
	
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
 	 	НовСтр = ТекущийДокументОбъект.ЗаказыВРаботе.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
    КонецЦикла;
    
	ЗначениеВРеквизитФормы(ТекущийДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КомандаОбновитьСписокНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры
